# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
n1 = int(input("Введіть перше число: "))
n2 = int(input("Введіть друге число: "))
# Обчислюємо суму
suma = n1 + n2
# Виводимо результат
print("Сума двох чисел =", suma)


# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
a = float(input("Введіть довжину першого катета: "))
b = float(input("Введіть довжину другого катета: "))
# Обчислюємо гіпотенузу за теоремою Піфагора
c = (a**2 + b**2) ** 0.5
# Виводимо результат
print("Довжина гіпотенузи =", c)

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
nz = int(input("Введіть ціле число: "))
print(nz, nz)

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.
name = input("Введіть своє ім'я: ")
print(f"Привіт, {name}!")

# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.
name = input("Введіть своє ім'я: ")
print(f"Прощавай, {name}!")

🟢 input()
Функція input() використовується, щоб отримати дані від користувача через клавіатуру.
Введене значення зберігається у вигляді рядка (str) у змінній.
🔹 Як зробити інший тип змінної
Щоб перетворити (кастувати) введене значення на інший тип, використовують функції:
int() — для цілих чисел
float() — для чисел з комою
bool() — для логічних значень (True / False)
str() — для рядків (іноді, якщо хочеш навпаки перетворити інший тип у текст)

🟣 print()
Функція print() використовується, щоб вивести текст або значення на екран.
🔹 Особливості:
Може виводити кілька значень через кому.
Автоматично додає новий рядок після кожного виклику.
Може виводити змінні, числа, рядки, результати обчислень тощо.


f"..." — це f-рядок (f-string), або форматований рядок.
Він дозволяє вставляти значення змінних безпосередньо в текст, використовуючи фігурні дужки {}.
{name} — у цих дужках вказано змінну name, значення якої буде підставлено в текст.

