# # 1. Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).
# n = int(input("Введіть кількість повторень: "))
# for k in range(n):
#     print("Hello, Python!")

# #2. Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.
# a = int(input("Введіть число a: "))
# b = int(input("Введіть число b(b >= a): "))
# for i in range(a, b + 1):
#     print(i, end=" ")

# #3.  Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік
# n = int(input("Введіть кількість секунд: "))
# # Зворотний відлік
# for i in range(n, 0, -1):
#     print(i)
# print("Start!")

# #4. Користувач вводить кількість навчальних предметів `n`, а потім, відповідно, оцінки учня з `n` навчальних предметів. Визначте середню оцінку.
# 1 варінт
# n = int(input("Введіть кількість навчальних предметів: "))
# grades = []
# for i in range(n):
#     grade = float(input(f"Введіть оцінку з предмету №{i+1}: "))
#     grades.append(grade)
# average = sum(grades) / n
# print(f"Середня оцінка: {average:.2f}")
# # 2 варінт
# n = int(input("Введіть кількість предметів: "))
# grades = list(map(float, input("Введіть оцінки через пробіл: ").split()))
# average = sum(grades) / n
# print(f"Середня оцінка: {average:.2f}")

# 5. Надрукувати у рядку `m` разів число `n`. Числа `m` і `n` - цілі числа, які вводить користувач у порядку `n`, `m`.
# n = int(input("Введіть число n: "))
# m = int(input("Введіть число m: "))
# print((str(n) + ' ') * m)

# 6. Напишіть програму для друку цілих чисел від `n` до 0 із виведенням біля кожного числа кількості символів `#`, що дорівнює значенню числа.
# n = int(input("input number: "))
# for i in range(n, 0, -1):
#     print (i, "#" * i)

# 7. Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням `n`.
# n = int(input("input number: "))
# for i in range(1, n + 1):
#      print ( str(i) * i)

# Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки `#`, коли на вхід програми подається ціле число `n` - кількість сходинок.
# n = int(input("input number: "))
# for i in range(1, n):
#      print ("#" * i)

# # 9. За даним цілим додатнім числом `n` обчисліть `n!` - значення факторіалу цього числа.
# #     > Факторіал: **n! = 1 * 2 * 3 * ... * (n-1) * n**
# n = int(input("count: "))
# f = 1
# while n >0:
#     f *= n
#     n -= 1
# print(f)

# n = int(input("count: "))
# f = 1
# for i in range(1, n+1):
#     f *= i
# print (f)

# 10. Автогонщик в перший день ралі проїхав `d` км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить `t` км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: `d`, `t`.
# n = float(input("Автогонщик в перший день ралі проїхав (км): "))
# print ("Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня")
# l = float(input("Введіть максимальний дозволений сумарний пробіг: "))
# d = 1
# r = n
# while r <= l:
#      n = n*1.1
#      d = d + 1  
#      r = r + n
# print("Через ", d, " днів сумарний пробіг перевищить максимально дозволений")
# print(f"і буде становити {r:.2f} км")

# 11. Дано ціле число `n`. З чисел 1, 4, 9, 16, 25, …​ надрукувати ті, які не перевищують `n`. *(зверніть увагу на задану послідовність)*
# n = int(input("Введіть число n: "))
# i = 1
# while i * i <= n:
#     print(i * i)
#     i += 1

# # 12. Дано цілі числа `a` і `b`. Обчислити a ^ b (a в степені b), не використовуючи операцію піднесення до степеня.

# a = int(input("введи ціле число а: "))
# b = int(input("введи ціле число b більше 0: "))
# astb = a
# for i in range(1, b): 
#     astb=astb * a
# print ("a в степені b =", astb)