print("Hallo Word")

# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
n1 = int(input("Введіть перше число: "))
n2 = int(input("Введіть друге число: "))
# Обчислюємо суму
suma = n1 + n2
# Виводимо результат
print("Сума двох чисел =", suma)


# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
a = float(input("Введіть довжину першого катета: "))
b = float(input("Введіть довжину другого катета: "))
# Обчислюємо гіпотенузу за теоремою Піфагора
c = (a**2 + b**2) ** 0.5
# Виводимо результат
print("Довжина гіпотенузи =", c)














