# Домашнє завдання:
# Задача 1. Середнє трьох чисел# Користувач вводить три числа. Обчисли середнє арифметичне.
# Задача 2. Остача від ділення# Користувач вводить два числа. Знайди остачу від ділення першого на друге.
# Задача 3. Подвоєне число# Користувач вводить число. Виведи подвоєне значення цього числа.
# Задача 4. Конвертація хвилин у секунди# Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.
# Задача 5. Кількість яблук на кожного# Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?
# Задача 6. Остання цифра числа# Користувач вводить число. Виведи його останню цифру.
# Задача 7*. Обмін змінних# Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.




